run/navalFoam/hullSlammingMovingBox2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hull
    {
        type            wall;
        nFaces          60;
        startFace       13015;
    }
    left
    {
        type            symmetryPlane;
        nFaces          95;
        startFace       13075;
    }
    right
    {
        type            patch;
        nFaces          95;
        startFace       13170;
    }
    bottom
    {
        type            patch;
        nFaces          60;
        startFace       13265;
    }
    top
    {
        type            patch;
        nFaces          60;
        startFace       13325;
    }
    frontAndBack
    {
        type            empty;
        nFaces          13200;
        startFace       13385;
    }
)

// ************************************************************************* //
