run/navalFoam/hullSlammingMovingBox2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1.0;
}

divSchemes
{
    div(rho*phi,U)  Gauss reconCentral cellLimited Gauss linear 1.0;
//     div(phi,alpha)   Gauss Gamma01 0.5;
//     div(phirb,alpha) Gauss interfaceCompression;
    div(phi,alpha)   Gauss CICSAM 0.5;
    div(phirb,alpha) off;
    div(phi,k)      Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(R)          Gauss linear;

    div((nuEff*dev(grad(U).T()))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default           linear;
    interpolate(U)    reconCentral phi cellLimited leastSquares 1.0;
    interpolate(HbyA)  harmonic;
}

snGradSchemes
{
    default         limited 0.5;
}

fluxRequired
{
    default         no;
    pd;
    pcorr;
    alpha1;

    p;
}


// ************************************************************************* //
