run/navalFoam/hullSlammingMovingBox2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pd
    {
        solver             CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      0;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           on;
            smoother        ILU;
        }

        minIter           0;
        maxIter           200;
        tolerance         1e-7;
        relTol            0.01;
    };

    pdFinal
    {
        solver             CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      0;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           on;
            smoother        ILU;
        }

        minIter           0;
        maxIter           200;
        tolerance         1e-7;
        relTol            0.0;
    };

    alpha1
    {
        preconditioner    DILU;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };

//     U BiCGStab
//     {
//         solver            BiCGStab;
//         preconditioner      Cholesky;

//         minIter           0;
//         maxIter           500;
//         tolerance         1e-8;
//         relTol            0.0;
//     };

    U
    {
        solver            smoothSolver;
        smoother          ILU;
        nSweeps           2;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };

    k
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };

    omega
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };
}

PISO
{
    cAlpha          1;
}

PIMPLE
{
    pRefPoint       (0.65 0.95 0);
    pRefValue       0.0;

    nCorrectors        6;
    nOuterCorrectors   2;
    nNonOrthogonalCorrectors 0;

    nAlphaSubCycles 1;

    singlePhase     no;
    implicitAlpha   off;
    implicitP       on;

    correctPhi      off;
    checkMeshCourantNo  off;

    limitMagU       200;
    startMotionTime 0;
}

relaxationFactors
{
    U        1;
    pd       1;
    p        1;
}


// ************************************************************************* //
